<template>
  <div class="user-agreement" id="user-agreement">
    <p>好芳法课堂 用户注册协议 以下简称为“好芳法”</p>
    <p>在使用本系统的所有功能之前，请您务必仔细阅读并透彻理解本声明。您可以选择不使用本系统，但如果您使用本系统，您的使用行为将被视为对本声明全部内容的认可。</p>
    <p>免责声明： 鉴于本系统使用非人工检索/分析方式，无法确定您输入的条件进行是否合法，所以本系统对检索/分析出的结果不承担责任。如果因以本系统的检索/分析结果作为任何商业行为或者学术研究的依据而产生不良后果，本系统不承担任何法律责任。</p>
    <p>关于隐私权： 访问者在本系统注册时提供的一些个人资料，本系统除您本人同意外不会将用户的任何资料以任何方式泄露给第三方。当政府部门、司法机关等依照法定程序要求本系统披露个人资料时，本系统将根据执法单位之要求或为公共安全之目的提供个人资料，在此情况下的披露，本系统不承担任何责任。</p>
    <p>关于版权：</p>
    <p>一、 凡本系统注明“好芳法”“王芳”的所有作品，其版权属于北京爱看爱秀教育科技有限公司所有。其他媒体、网站或个人转载使用时不得进行商业性的原版原式的转载，也不得歪曲和篡改本系统所发布的内容。</p>
    <p>二、 被本系统授权使用的单位，不应超越授权范围。</p>
    <p>三、 本平台提供的资料如与相关纸质文本不符，以纸质文本为准。</p>
    <p>四、 如因作品内容、版权和其它问题需要同本系统联系的，请在本系统发布该作品后的30日内进行。</p>
    <p>关于解释权： 本系统之声明以及其修改权、更新权及最终解释权均属本站以及IKE 所有。</p>
    <p>好芳法免责声明</p>
    <p>好芳法的各项电子服务的所有权和运作权归北京爱看爱秀教育科技有限公司。好芳法提供的服务将完全按照其发布的章程、服务条款和操作规则严格执行。会员若完全同意所有服务条款，并完成注册程序，即可成为好芳法的正式会员。基于好芳法提供的网络服务的商业性和时效性： ⑴ 会员对其发布的信息负责，应提供详尽、真实、准确的企业资料，不得发布不真实的、有歧义的信息，绝对禁止发布误导性的、恶意的消息。</p>
    <p>⑵ 随时更新注册资料，以符合及时、详尽、准确的要求。</p>
    <p>⑶好芳法向会员提供的会员帐号及密码只供会员使用。如果会员将帐号或密码丢失或被盗，应及时重新登记并重新设置密码。会员造成的帐号失密，应自行承担责任。</p>
    <p>⑷ 会员发现好芳法发布的信息不准确或发生错误，以及其它错误行为，应及时通知本网。若问题未能及时解决，可进入本网的投诉程序。</p>
    <p>⑸好芳法向会员提供的商品信息之编辑、编制、传播的版权和知识产权，全部由好芳法拥有；未经好芳法事先以书面表示同意，任何人不得以各种形式复制、散布、出售、出版、广播、转播该商品信息。</p>
    <p>⑹好芳法如发现会员提供的资料包含有不正确或者违法的信息，将发出警告，并保留停止或终止其会员资格的权利。</p>
    <p>⑺ 会员如违反本协议而造成好芳法的经济损失，本网有权追究其经济责任与法律责任。</p>
    <p>会员权利与义务</p>
    <p>⑴ 会员承诺遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等七条底线；</p>
    <p>⑵ 会员在其名称、头像和简介等注册信息中不得出现违法和不良信息；</p>
    <p>⑶好芳法将配备与服务规模相适应的专业人员，对会员提交的账号名称、头像和简介等注册信息进行审核，对含有违法和不良信息的，不予注册，对会员发布的违法信息，有权进行删除处理，多次出现违法行为的账号，好芳法有权删除账号，并不退还相关款项。</p>
    <p>⑷好芳法保护用户信息及公民个人隐私，自觉接受社会监督，及时处理公众举报的账号名称、头像和简介等注册信息中的违法和不良信息。</p>
    <p>会员的所有行为必须符合国家法律的规定，如违反国家法律规定和本协议，出现任何纠纷及不良结果，将由行为人独立承担所有责任。</p>
    <p>浏览者可以截图好芳法显示的资料，但这些资料只限用于个人学习研究使用，不得用于任何商业用途，无论是否在资料上明示，所有此等资料都是受到版权法的法律保护。浏览者没有获得好芳法或各自的版权所有者明确的书面同意下，不得分发、修改、散布、再使用、再传递或使用本网站的内容用于任何公众商业用途。</p>
    <p>免责声明</p>
    <p>好芳法在此特别声明对如下事宜不承担任何法律责任：</p>
    <p>（一）好芳法在此声明，对您使用本App 、与本App 相关的任何内容、服务或其它链接至本App 的应用、站点、内容均不作直接、间接、法定、约定的保证。</p>
    <p>（二） 无论在任何原因下（包括但不限于疏忽原因），对您或任何人通过使用本App 上的信息或由本网站链接的信息，或其他与本网站链接的网站信息所导致的损失或损害 （包括直接、间接、特别或后果性的损失或损害，例如收入或利润之损失，电脑系统之损坏或数据丢失等后果），责任均由使用者自行承担（包括但不限于疏忽责任）</p>
    <p>使用者对本App 的使用即表明同意承担浏览本网站的全部风险，由好芳法、好芳法运营商或好芳法关联公司未参与建设、制作或发展本平台或提供内容，对使用者在本网站存取资料所导致的任何直接、相关的、后果性的、间接的或金钱上的损失不承担任何责任。</p>
    <p>投诉举报规则</p>
    <p>一、举报概述：</p>
    <p>为了保障用户的合法权益，任何企业都有权利和义务对出现的违规信息或者违规交易行为等情况进行举报。</p>
    <p>举报事实成立后：我们会对被举报方做出相应的处罚并备档，同时删除违规信息。 举报电话：400-898-0908</p>
    <p>收件地址：北京市大兴区鸿坤金融谷北区一号楼</p>
  </div>
</template>

<script>
  import util from '../util'

  export default {
    name: '',
    data() {
      return {}
    },
    created() {

    },
    mounted() {
      document.title = '用户服务协议'
      util.wxConfig(window.location.href.split('#')[0])
      util.commonShare()
    },
    components: {},
    methods: {
    }
  }
</script>
<style lang="less">
.user-agreement{
  box-sizing: border-box;
  padding: 1rem;
  p{
    text-indent: 2rem;
  }
}
</style>
